$(document).ready(function () {
    loadBachelorDegree();
    $(".BachelorDegree").change(function () {
        $(this).closest('div').find('.GraduateEducation').addClass("temp09120217432class");
        loadGraduateEducation($(this).val());
    });
});

function loadBachelorDegree() {
    selectValues = {
        "": "", "مهندسی عمران": "مهندسی عمران", "مهندسی برق": "مهندسی برق", "مهندسی مکانیک": "مهندسی مکانیک", "مهندسی صنایع": "مهندسی صنایع", "مهندسی کامپیوتر": "مهندسی کامپیوتر", "مهندسی متالوژی": "مهندسی متالوژی", "مهندسی نفت": "مهندسی نفت", "مهندسی شیمی": "مهندسی شیمی", "مهندسی معماری": "مهندسی معماری", "مهندسی معدن": "مهندسی معدن", "مهندسی کشاورزی": "مهندسی کشاورزی", "مهندسی نساجی": "مهندسی نساجی", "مهندسی هوافضا": "مهندسی هوافضا"
    };

    $.each(selectValues, function (key, value) {
        $('.BachelorDegree')
            .append($("<option></option>")
                .attr("value", key)
                .text(value));
    });
}

//Load branch for selete
function loadGraduateEducation(BachelorDegree) {
    $(".temp09120217432class").find('option').remove();

    switch (BachelorDegree) {
        case "مهندسی عمران":
            var selectValues = { "مهندسی عمران": "مهندسی عمران", "مهندسی نقشه‌برداری": "مهندسی نقشه‌برداری", "مهندسی سازه": "مهندسی سازه", "مهندسی آب": "مهندسی آب", "مهندسی ژئوتکنیک": "مهندسی ژئوتکنیک", "مهندسی حمل و نقل و راه": "مهندسی حمل و نقل و راه", "مهندسی هیدرولیک": "مهندسی هیدرولیک", "مهندسی سازه‌های دریایی": "مهندسی سازه‌های دریایی", "ژئودزی": "ژئودزی", "مهندسی کنترل": "مهندسی کنترل", "مهندسی شهری": "مهندسی شهری" };
            break;
        case "مهندسی برق":
            var selectValues = { "مهندسی برق": "مهندسی برق", "مهندسی قدرت": "مهندسی قدرت", "مهندسی الکترونیک": "مهندسی الکترونیک", "مهندسی مخابرات": "مهندسی مخابرات", "مهندسی کنترل": "مهندسی کنترل", "مهندسی پزشکی": "مهندسی پزشکی", "شبکه‌های انتقال و توزیع": "شبکه‌های انتقال و توزیع" };
            break;
        case "مهندسی مکانیک":
            var selectValues = { "مهندسی مکانیک": "مهندسی مکانیک", "حرارت‌ و سیالات": "حرارت‌ و سیالات", "طراحی‌ جامدات‌": "طراحی‌ جامدات‌", "ساخت‌ و تولید": "ساخت‌ و تولید", "مهندسی‌ دریا": "مهندسی‌ دریا" };
            break;
        case "مهندسی صنایع":
            var selectValues = { "مهندسی صنایع": "مهندسی صنایع", "مدیریت سیستم و بهره‌وری": "مدیریت سیستم و بهره‌وری", "سیستم‌‌های اقتصادی و اجتماعی": "سیستم‌‌های اقتصادی و اجتماعی" };
            break;
        case "مهندسی کامپیوتر":
            var selectValues = { "مهندسی کامپیوتر": "مهندسی کامپیوتر", "سخت‌افزار": "سخت‌افزار", "نرم‌افزار": "نرم‌افزار", "فناوری اطلاعات": "فناوری اطلاعات" };
            break;
        case "مهندسی متالوژی":
            var selectValues = { "مهندسی متالوژی": "مهندسی متالوژی", "جوشکاری": "جوشکاری", "شناسایی و انتخاب مواد": "شناسایی و انتخاب مواد", "حفاظت و خوردگی مواد": "حفاظت و خوردگی مواد", "شکل دادن فلزات": "شکل دادن فلزات", "استخراج فلزات": "استخراج فلزات", "ریخته گری": "ریخته گری", "نانوفناوری- نانو مواد": "نانوفناوری- نانو مواد", "شاخه‌ سرامیک‌": "شاخه‌ سرامیک‌" };
            break;
        case "مهندسی نفت":
            var selectValues = { "مهندسی نفت": "مهندسی نفت", "مهندسی‌ اکتشاف‌": "مهندسی‌ اکتشاف‌", "مهندسی‌ حفاری‌": "مهندسی‌ حفاری‌", "مخازن‌ نفت‌ ": "مخازن‌ نفت‌ " };
            break;
        case "مهندسی شیمی":
            var selectValues = { "مهندسی شیمی": "مهندسی شیمی", "فرآیندهای صنعت نفت": "فرآیندهای صنعت نفت", "صنایع غذایی": "صنایع غذایی", "بیوتکنولوژی": "بیوتکنولوژی", "پلیمر": "پلیمر", "صنایع گاز": "صنایع گاز", "ترموسینیتیك و كاتالیست": "ترموسینیتیك و كاتالیست", "پدیده‌های انتقال و فرآیندهای جداسازی": "پدیده‌های انتقال و فرآیندهای جداسازی", "مدلسازی، شبیه‌سازی و كنترل": "مدلسازی، شبیه‌سازی و كنترل", "محیط زیست": "محیط زیست", "پتروشیمی": "پتروشیمی", "پتروشیمی": "پتروشیمی", "نانوفناوری": "نانوفناوری", "صنایع شیمیایی معدنی": "صنایع شیمیایی معدنی" };
            break;
        case "مهندسی معماری":
            var selectValues = { "مهندسی معماری": "مهندسی معماری", "معماری مسکن": "معماری مسکن", "معماری پایدار": "معماری پایدار", "معماری فضاهای بهداشتی درمانی": "معماری فضاهای بهداشتی درمانی", "معماری فضاهای آموزشی و فرهنگی": "معماری فضاهای آموزشی و فرهنگی", "معماری فناوری": "معماری فناوری", "معماری فنی": "معماری فنی", "مرمت و احیای ابنیه و بافتهای تاریخی": "مرمت و احیای ابنیه و بافتهای تاریخی", "انرژی درهنرهای ساخت و معماری": "انرژی درهنرهای ساخت و معماری" };
            break;
        case "مهندسی معدن":
            var selectValues = { "مهندسی معدن": "مهندسی معدن", "استخراج معدن": "استخراج معدن", "اکتشاف معدن": "اکتشاف معدن", "مکانیک سنگ": "مکانیک سنگ", "فرآوری مواد معدنی": "فرآوری مواد معدنی" };
            break;
        case "مهندسی کشاورزی":
            var selectValues = { "مهندسی کشاورزی": "مهندسی کشاورزی", "مهندسی‌ آب‌": "مهندسی‌ آب‌", "مهندسی‌ اقتصاد کشاوری‌": "مهندسی‌ اقتصاد کشاوری‌", "مهندسی‌ ماشین‌های‌ کشاورزی‌ ": "مهندسی‌ ماشین‌های‌ کشاورزی‌ " };
            break;
        case "مهندسی نساجی":
            var selectValues = { "مهندسی نساجی": "مهندسی نساجی", " تکنولوژی‌ نساجی‌": " تکنولوژی‌ نساجی‌", "شیمی‌ نساجی‌ و علوم‌ الیاف‌": "شیمی‌ نساجی‌ و علوم‌ الیاف‌", "پوشاک": "پوشاک" };
            break;
        case "مهندسی هوافضا":
            var selectValues = { "مهندسی هوافضا": "مهندسی هوافضا", "آیرودینامیک": "آیرودینامیک", "پیشرانش": "پیشرانش", "دینامیک پرواز و کنترل": "دینامیک پرواز و کنترل", "سازه‌های هوافضایی": "سازه‌های هوافضایی", "مهندسی فضایی": "مهندسی فضایی", "اويونيك هواپيمایی": "اويونيك هواپيمایی" };
            break;
        case "":
            var selectValues = { "": "" }

    }


    $.each(selectValues, function (key, value) {
        $(".temp09120217432class")
            .append($("<option></option>")
                .attr("value", key)
                .text(value));
    });
    $(".temp09120217432class").removeClass("temp09120217432class");
}
